{
    "video_id": "KMgSn2YCfcI",
    "video_title": "only musketeers",
    "metadata": {
        "title": "only musketeers",
        "video_id": "KMgSn2YCfcI",
        "channel": {
            "name": "Ken",
            "url": "https://www.youtube.com/@kenforrest",
            "subscriber_count": null
        },
        "content": {
            "duration_seconds": 600,
            "duration_formatted": "10:00"
        },
        "engagement": {
            "view_count": "117,720 views",
            "upload_date": "Nov 6, 2025",
            "like_count": "11115"
        },
        "context": {
            "social_links": null
        },
        "extraction_timestamp": "2025-11-06T15:31:11.416Z"
    },
    "description": "No description available.",
    "chapters": [],
    "transcript_structured": [
        {
            "0:00": "Today we're going to try and win with five musketeers cycle. We're playing at 13,000 trophies with miner and a three musketeers rework and the new musketeer. Well, I guess it feels like a new musketeer, but it's exactly the same. And then mirror as well to get another one. And the plan is I'm just going to be cycling musketeers constantly the whole game. Miner on each side. It's just going to be a constant barrage of just consistent musketeers and that's how we're going to try and win the game. So, we're going to see how this goes. Um, I'm going to split the new musketss in the back and then I'm going to go for Today we're going to try and win with five musketeers cycle. We're playing at 13,000 trophies with miner and a three musketeers rework and the new musketeer. Well, I guess it feels like a new musketeer, but it's exactly the same. And then mirror as well to get another one. And the plan is I'm just going to be cycling musketeers constantly the whole game. Miner on each side. It's just going to be a constant barrage of just consistent musketeers and that's how we're going to try and win the game. So, we're going to see how this goes. Um, I'm going to split the new musketss in the back and then I'm going to go for"
        },
        {
            "0:30": "skellies here to try and get some value out of this. And then we also have the evolve musketeer. I hope that takes out the cannon cart. That'll be clutch if it does. Let's freaking go. All right, so we're playing the new musketeers and we're going to try and keep them alive and we're going to try and just like play miner every time and counter push and make the one musketeer a big threat cuz he'll absolutely have to answer the two and then with the one. Okay, that's perfect cuz he's going to rely on that now. Yes, perfect. So he went for the Valkyrie there and we're immediately going to get damage on the tower and the arrows is not going to kill it. They skellies here to try and get some value out of this. And then we also have the evolve musketeer. I hope that takes out the cannon cart. That'll be clutch if it does. Let's freaking go. All right, so we're playing the new musketeers and we're going to try and keep them alive and we're going to try and just like play miner every time and counter push and make the one musketeer a big threat cuz he'll absolutely have to answer the two and then with the one. Okay, that's perfect cuz he's going to rely on that now. Yes, perfect. So he went for the Valkyrie there and we're immediately going to get damage on the tower and the arrows is not going to kill it. They"
        },
        {
            "1:00": "would have killed the old ones and I can just let that go. This is the thing when they hit stuff with their [ __ ] their what's the bayonet. That's the one. When they hit it with that Oh my god, I just realized I can mirror my log here as well. Love doing that. All right, let's mirror my log. Um with the bayonet, which people were like, Ken definitely searched it up after he said it to make sure it was a bayonet. Okay, I don't I don't do anything. All right. I just play Clash. Outside of making videos, I just play Clash. So would have killed the old ones and I can just let that go. This is the thing when they hit stuff with their [ __ ] their what's the bayonet. That's the one. When they hit it with that Oh my god, I just realized I can mirror my log here as well. Love doing that. All right, let's mirror my log. Um with the bayonet, which people were like, Ken definitely searched it up after he said it to make sure it was a bayonet. Okay, I don't I don't do anything. All right. I just play Clash. Outside of making videos, I just play Clash. So"
        },
        {
            "1:30": "anyway, we're going to go for a musketeer in the back. The next one will be evolved, which will be kind of clutch for sniping the evolved I mean the cannon cart later in the game. So let's go for an ice golem in front and see what little bro is going to do. All right, let's just split the musketss. He hasn't revealed a big spell. So you know what? I'm just going to log that as well. Just going to log that. Let that cannon cut die. And this time he's probably going to know what I'm going to do. So I'm going to go for a minor on the Ewiz this time and see if we can anyway, we're going to go for a musketeer in the back. The next one will be evolved, which will be kind of clutch for sniping the evolved I mean the cannon cart later in the game. So let's go for an ice golem in front and see what little bro is going to do. All right, let's just split the musketss. He hasn't revealed a big spell. So you know what? I'm just going to log that as well. Just going to log that. Let that cannon cut die. And this time he's probably going to know what I'm going to do. So I'm going to go for a minor on the Ewiz this time and see if we can"
        },
        {
            "2:00": "catch him with his pants down here. So he's going to choose to just go with royal recruits. Okay, at least the musketeers are doing a pretty good job. We absolutely need evolve musketeer here. So let's go like this. Then let's go like this to kite. And then we should have enough elixir for the log. Perfect timing. Go for the log there. Easy peasy. And then Okay, I'm going to go for a minor early. Oh, please snipe the cannon cart. Please. I needed to snipe the cannon cart. Please. Okay, I think we wasted our evolved catch him with his pants down here. So he's going to choose to just go with royal recruits. Okay, at least the musketeers are doing a pretty good job. We absolutely need evolve musketeer here. So let's go like this. Then let's go like this to kite. And then we should have enough elixir for the log. Perfect timing. Go for the log there. Easy peasy. And then Okay, I'm going to go for a minor early. Oh, please snipe the cannon cart. Please. I needed to snipe the cannon cart. Please. Okay, I think we wasted our evolved"
        },
        {
            "2:30": "musketeer. I don't know about wasted, but we didn't get value. So, we're going to split musketss again. Poor guy. He just has to deal with this the whole [ __ ] game. And then let's go for smellies on the cannon cart. Very cool. And then let's go for another musketeer. Let's go for the the normal musketeer which does more damage right there. Let's see what he's going to do. Okay, let's go for an evolved ice spirit here to try and help out. Um, and then let's go for a This is going to be a clutch log. Very cool. He's probably going to musketeer. I don't know about wasted, but we didn't get value. So, we're going to split musketss again. Poor guy. He just has to deal with this the whole [ __ ] game. And then let's go for smellies on the cannon cart. Very cool. And then let's go for another musketeer. Let's go for the the normal musketeer which does more damage right there. Let's see what he's going to do. Okay, let's go for an evolved ice spirit here to try and help out. Um, and then let's go for a This is going to be a clutch log. Very cool. He's probably going to"
        },
        {
            "3:00": "Valkyrie the right. So, we'll go for a minor to make the left a threat. And he's going to have to play something otherwise he's going to take a lot of damage. And I'm going to go for an ice spirit here to try and clutch up. Okay, let's just go for a musketeer to counter this. That's going to be fine. Pull this back with smellies. And then we're going to go with three musketeers in the back here. [ __ ] it. We ball. Three musketeers in the back. Just let that go. Actually, you know what? Let's go for an ice golem just to make sure that it can lock on before the royal recruits, please. Okay. He chose not to go royal recruits. That's very good. We want that to die. Valkyrie the right. So, we'll go for a minor to make the left a threat. And he's going to have to play something otherwise he's going to take a lot of damage. And I'm going to go for an ice spirit here to try and clutch up. Okay, let's just go for a musketeer to counter this. That's going to be fine. Pull this back with smellies. And then we're going to go with three musketeers in the back here. [ __ ] it. We ball. Three musketeers in the back. Just let that go. Actually, you know what? Let's go for an ice golem just to make sure that it can lock on before the royal recruits, please. Okay. He chose not to go royal recruits. That's very good. We want that to die."
        },
        {
            "3:30": "Okay. Let's go like this and this. He's probably going to go for Oh, he's not going to go for a Valkyrie. Okay. At least the flying machine died there. So, let's go with skellies to help kill this. And then let's go for a ice golem. Okay. We're going to have to go with a little bit of a janky D right now. Let's go for this [ __ ] And then that's got to jump on the cannon cut. Nice. And then that thing is going to do a fuckload of damage unless I go for an ice golem. So Okay. Let's go like this and this. He's probably going to go for Oh, he's not going to go for a Valkyrie. Okay. At least the flying machine died there. So, let's go with skellies to help kill this. And then let's go for a ice golem. Okay. We're going to have to go with a little bit of a janky D right now. Let's go for this [ __ ] And then that's got to jump on the cannon cut. Nice. And then that thing is going to do a fuckload of damage unless I go for an ice golem. So"
        },
        {
            "4:00": "hopefully I can kill a lot of the sk the skeletons. All right, so now we need to reset. I think now that it's triple, I might go for a double three musketeers. Ooh, this this would be the moment to do it as well, just for the meme. [ __ ] it. Let's go for the Let's go for the the 10 elixir musketeers and let's see. Oh my god. Let's see how he defends this. All right. I've never actually had this many musketeers on the map. Let's go for an ice golem. Let's go for this. And let's see if we can uh see if we can No, one hopefully I can kill a lot of the sk the skeletons. All right, so now we need to reset. I think now that it's triple, I might go for a double three musketeers. Ooh, this this would be the moment to do it as well, just for the meme. [ __ ] it. Let's go for the Let's go for the the 10 elixir musketeers and let's see. Oh my god. Let's see how he defends this. All right. I've never actually had this many musketeers on the map. Let's go for an ice golem. Let's go for this. And let's see if we can uh see if we can No, one"
        },
        {
            "4:30": "of my musketeers is going to die. Okay. Oh my god. Wait, can I do it again? No. I' I've got to protect my musketeers. I got to be wise. All right. You know what? He's going to go for a Valkyrie. So, I'm going to go with this to try and kill it. And oh my god, they use their bayonets. And so, holy [ __ ] smokes, there's a lot of musketeers. And I think we're gonna break through. We're gonna go for the musketeers at the bridge for the memes and see if he's going to goblin gang or something. And that's going to be GG. My guy can't keep up. I did not expect it to work that well in of my musketeers is going to die. Okay. Oh my god. Wait, can I do it again? No. I' I've got to protect my musketeers. I got to be wise. All right. You know what? He's going to go for a Valkyrie. So, I'm going to go with this to try and kill it. And oh my god, they use their bayonets. And so, holy [ __ ] smokes, there's a lot of musketeers. And I think we're gonna break through. We're gonna go for the musketeers at the bridge for the memes and see if he's going to goblin gang or something. And that's going to be GG. My guy can't keep up. I did not expect it to work that well in"
        },
        {
            "5:00": "the first game. I did not expect to have a moment where I was mirroring the three musketeers. I thought the mirror was just going to be for the one musketeer and the only gimmick I'd be able to get is three musketeers, one musketeer plus another musketeer. So, five musketeers. I can do mathematics. Smash subscribe. And so, yeah, that was really good. The royal recruits held [ __ ] up, which meant I could get I think I got seven I think I got seven musketeers on the map. So, hopefully we can live up to the reputation of that first game because the first game. I did not expect to have a moment where I was mirroring the three musketeers. I thought the mirror was just going to be for the one musketeer and the only gimmick I'd be able to get is three musketeers, one musketeer plus another musketeer. So, five musketeers. I can do mathematics. Smash subscribe. And so, yeah, that was really good. The royal recruits held [ __ ] up, which meant I could get I think I got seven I think I got seven musketeers on the map. So, hopefully we can live up to the reputation of that first game because"
        },
        {
            "5:30": "that was [ __ ] insane. And see if we can Okay, so we're against the Master Beta. He's got Goblin Barrel. He's got Princess. And he's going to get a fuckload of damage to start. If he has rocket, I might just rocket my own brain. Let's see. Will he go for a rocket here? Okay, thank god he doesn't play the rocket. All right, let's go for this. And let's go for an ice golem in this lane. We want him to struggle here. So, let's go for Okay, that's fine. that was [ __ ] insane. And see if we can Okay, so we're against the Master Beta. He's got Goblin Barrel. He's got Princess. And he's going to get a fuckload of damage to start. If he has rocket, I might just rocket my own brain. Let's see. Will he go for a rocket here? Okay, thank god he doesn't play the rocket. All right, let's go for this. And let's go for an ice golem in this lane. We want him to struggle here. So, let's go for Okay, that's fine."
        },
        {
            "6:00": "Musketeer is actually going to lock on the tower there. Not bad. And he's going to go with a prince. So, I'm going to go with a a normal musk and an evolved ice spirit. And that should be able to take that all out. All right, clutch. I think people get like a little bit scared when playing against so many musketeers. People kind of freak out. It's one of those cards like Lava Hound where people kind of just freak out against it. Let's go for a log on the Goblin Barrel. If he goes for another really annoying bait unit, I can always just mirror my log. But otherwise, we're going to get some chip damage. And he might go with a Musketeer is actually going to lock on the tower there. Not bad. And he's going to go with a prince. So, I'm going to go with a a normal musk and an evolved ice spirit. And that should be able to take that all out. All right, clutch. I think people get like a little bit scared when playing against so many musketeers. People kind of freak out. It's one of those cards like Lava Hound where people kind of just freak out against it. Let's go for a log on the Goblin Barrel. If he goes for another really annoying bait unit, I can always just mirror my log. But otherwise, we're going to get some chip damage. And he might go with a"
        },
        {
            "6:30": "princess on the bridge here. So, I think he's playing Well, I know he's playing prince bait. He's got dark goblin. He's got princess. So, I'm going to go three musketeers. Okay, I'm going to log that just to get rid of it. Otherwise, it's kind of annoying if I go skellies and he plays a bunch of [ __ ] Then, let's go for an ice golem. We're just going to have to counter this [ __ ] unfortunately. At least we have the evolve musketeer now. So, if he plays like a princess or a dark goblin all the way in the back, we can snipe it. But, let's go for a cheeky 3M. Double elixir is here now. And he is going to go for princess on the bridge here. So, I think he's playing Well, I know he's playing prince bait. He's got dark goblin. He's got princess. So, I'm going to go three musketeers. Okay, I'm going to log that just to get rid of it. Otherwise, it's kind of annoying if I go skellies and he plays a bunch of [ __ ] Then, let's go for an ice golem. We're just going to have to counter this [ __ ] unfortunately. At least we have the evolve musketeer now. So, if he plays like a princess or a dark goblin all the way in the back, we can snipe it. But, let's go for a cheeky 3M. Double elixir is here now. And he is going to go for"
        },
        {
            "7:00": "the dark goblin. And he does have rocket. It just he didn't have enough in single. All right, let's go for the skeletons to help protect that. Now, I could I think I'm going to go for a minor in the back for the chip damage here. And then I could try and predict. Okay, good thing I didn't. Let's go for Let's go for a log here. And then let's go for a musketeer. That's not going to kill the rascal girls. Okay, at least he played that deep. So, the skeleton's going to go kind of crazy. Nice. And musketeer. Okay, relax. You didn't need the dark goblin. And he does have rocket. It just he didn't have enough in single. All right, let's go for the skeletons to help protect that. Now, I could I think I'm going to go for a minor in the back for the chip damage here. And then I could try and predict. Okay, good thing I didn't. Let's go for Let's go for a log here. And then let's go for a musketeer. That's not going to kill the rascal girls. Okay, at least he played that deep. So, the skeleton's going to go kind of crazy. Nice. And musketeer. Okay, relax. You didn't need"
        },
        {
            "7:30": "to do all that. Let's split these again. If he rockets, I might just mirror them for the meme. I might just go [ __ ] [ __ ] it. Yeah. Oh, the musketeers sniped the princess with the last bullet. This might be one of the goofiest troll videos I've done in a while. Let's go for the musketeers in the back. Now, we'll see what little bro does. I'm surprised I'm getting value out of the mirror. All right, let's go for a log here. Um, and then we can counter that pretty easy. And he's probably going to go for a prince. All to do all that. Let's split these again. If he rockets, I might just mirror them for the meme. I might just go [ __ ] [ __ ] it. Yeah. Oh, the musketeers sniped the princess with the last bullet. This might be one of the goofiest troll videos I've done in a while. Let's go for the musketeers in the back. Now, we'll see what little bro does. I'm surprised I'm getting value out of the mirror. All right, let's go for a log here. Um, and then we can counter that pretty easy. And he's probably going to go for a prince. All"
        },
        {
            "8:00": "right, let's go for a minor there. So, let's go for this for the prince. And he's not going to have anything. I think he's just given up. He's just [ __ ] given up. Have I created the most broken tactic of all time? Just three musketeers, mirror, and musketeer. What the [ __ ] is going on? It's like you have an answer for everything because the three musketeers can hit [ __ ] The musketeer evolution snipe [ __ ] across the map. The musketeer by itself does extra damage. And then you just play a miner to tank. And all right, little bro. Good luck, my my slime. Let's go right, let's go for a minor there. So, let's go for this for the prince. And he's not going to have anything. I think he's just given up. He's just [ __ ] given up. Have I created the most broken tactic of all time? Just three musketeers, mirror, and musketeer. What the [ __ ] is going on? It's like you have an answer for everything because the three musketeers can hit [ __ ] The musketeer evolution snipe [ __ ] across the map. The musketeer by itself does extra damage. And then you just play a miner to tank. And all right, little bro. Good luck, my my slime. Let's go"
        },
        {
            "8:30": "for a musky in the back. cycle the EVO. I also like having uh Evo. Wait a second. What is my other EVO? Wait. Yeah. What's my other EVO? Let's go for a minor here cuz I Oh, ice spirit. I was thinking maybe I needed to play Evo skeletons, but I'm liking ice spirits so far. Maybe I could play skeletons to be fair. Please kill it. Okay, we do kill the boss band at the bridge there, which is good. And we're already back to musketeer. It feels illegal that the cycle's this quick. for a musky in the back. cycle the EVO. I also like having uh Evo. Wait a second. What is my other EVO? Wait. Yeah. What's my other EVO? Let's go for a minor here cuz I Oh, ice spirit. I was thinking maybe I needed to play Evo skeletons, but I'm liking ice spirits so far. Maybe I could play skeletons to be fair. Please kill it. Okay, we do kill the boss band at the bridge there, which is good. And we're already back to musketeer. It feels illegal that the cycle's this quick."
        },
        {
            "9:00": "Okay, let's go for a musketeer. And let's go for a ice spirit here. And because that died, let's go for that. And he uses his poison. This is another thing. There's so much spell bait in a weird way cuz people love using spells against musketeers. And now we can just activate our king tower, which is going to be a perfect start. And then we can go for the 3M in the back. Oh, this is going to be excellent. All right, let's go for the three musketeers. Now king tower's activated. He's used his poison. What does he got? I don't expect these Okay, let's go for a musketeer. And let's go for a ice spirit here. And because that died, let's go for that. And he uses his poison. This is another thing. There's so much spell bait in a weird way cuz people love using spells against musketeers. And now we can just activate our king tower, which is going to be a perfect start. And then we can go for the 3M in the back. Oh, this is going to be excellent. All right, let's go for the three musketeers. Now king tower's activated. He's used his poison. What does he got? I don't expect these"
        },
        {
            "9:30": "musketeers to get any damage if I'm being honest. Or do I go for it? Okay, I'm going to go for it. I'm going to go for this in the back. I'm just going to kind of let this go. And that's going to snipe the [ __ ] witch. Oh my god. All right. Uh I hope Nice. He He wasted I I reckon that was a waste of elixir there cuz he should have just let that go cuz he's got a [ __ ] thousand musketeers to deal with. So, we're going to just try and crumb out some damage before the poison tick does too much. musketeers to get any damage if I'm being honest. Or do I go for it? Okay, I'm going to go for it. I'm going to go for this in the back. I'm just going to kind of let this go. And that's going to snipe the [ __ ] witch. Oh my god. All right. Uh I hope Nice. He He wasted I I reckon that was a waste of elixir there cuz he should have just let that go cuz he's got a [ __ ] thousand musketeers to deal with. So, we're going to just try and crumb out some damage before the poison tick does too much."
        },
        {
            "10:00": "And the firecracker doesn't shoot the ice golem. So, we get so much damage there. Oh my god. Let's go for skellies here. And all right, this is going excellently against Blondie as well. He used his poison as well. Now, he is playing a really quick cycle, but I'm still going to go for it. [ __ ] it, we ball. Let's go for the musketss in the back. And I feel like these guys are just scared to attack. My god, what I would have killed to have a [ __ ] evolved musketeer for that right now. But let's go for another musket. And the firecracker doesn't shoot the ice golem. So, we get so much damage there. Oh my god. Let's go for skellies here. And all right, this is going excellently against Blondie as well. He used his poison as well. Now, he is playing a really quick cycle, but I'm still going to go for it. [ __ ] it, we ball. Let's go for the musketss in the back. And I feel like these guys are just scared to attack. My god, what I would have killed to have a [ __ ] evolved musketeer for that right now. But let's go for another musket."
        },
        {
            "10:30": "And then let's go for this and this. And we're going to try our best to Oh, that's going to dash on that. Okay, I'm going to go for an evolved ice spirit to help out against that. We didn't really need it. Go for a log here. And then Okay, that that's really good. And he's poisoned. I'm going to go for a miner in the back to try and chip this tower down cuz he kind of has to worry about a million things. And I could always mirror my miner, but I'm going to keep playing it like this. Let's go for musketss again. [ __ ] it. And then Oh my god, he's feeding me And then let's go for this and this. And we're going to try our best to Oh, that's going to dash on that. Okay, I'm going to go for an evolved ice spirit to help out against that. We didn't really need it. Go for a log here. And then Okay, that that's really good. And he's poisoned. I'm going to go for a miner in the back to try and chip this tower down cuz he kind of has to worry about a million things. And I could always mirror my miner, but I'm going to keep playing it like this. Let's go for musketss again. [ __ ] it. And then Oh my god, he's feeding me"
        },
        {
            "11:00": "value. I think I'm just going to I'm just going to go for an ice spirit. And then let the Okay, you know what? [ __ ] the musketeers. Let's go like this [ __ ] And let's see what he does about this double miners on the tower. Wait, Mirror is actually so trolly. I should just I should just play mirror in like every dick I play from now on. Yep. Just like that, the game's over. I feel like I could do like a whole separate strategy where I just mirror minor on value. I think I'm just going to I'm just going to go for an ice spirit. And then let the Okay, you know what? [ __ ] the musketeers. Let's go like this [ __ ] And let's see what he does about this double miners on the tower. Wait, Mirror is actually so trolly. I should just I should just play mirror in like every dick I play from now on. Yep. Just like that, the game's over. I feel like I could do like a whole separate strategy where I just mirror minor on"
        },
        {
            "11:30": "the tower over and over again cuz they come in the same line and it's like you can't tell that there's two. I don't know. I didn't notice cuz sometimes the mirror logo kind of pops up on the tower and then you can see where the mine is going to go before it lands. Uh or it pops up, whatever the [ __ ] it does. All right, he's not playing anything. Let's go for a musky in the back. Cyclar Evo. Evo ice spirit is proving to be decent so far. I thought that the Evo smelleans might be good for okay we against log bait again for if I can't afford the musketeers but the thing is I would the tower over and over again cuz they come in the same line and it's like you can't tell that there's two. I don't know. I didn't notice cuz sometimes the mirror logo kind of pops up on the tower and then you can see where the mine is going to go before it lands. Uh or it pops up, whatever the [ __ ] it does. All right, he's not playing anything. Let's go for a musky in the back. Cyclar Evo. Evo ice spirit is proving to be decent so far. I thought that the Evo smelleans might be good for okay we against log bait again for if I can't afford the musketeers but the thing is I would"
        },
        {
            "12:00": "rather go for a normal musketeer than then rely on my evo skeletons because then I cycle to the evo. All right that gets a hit if I don't go for skeletons. So let's go for skellies here as well. It looks where like we're against log bait. The question is does he have a big spell? Let's go for musketss. [ __ ] it. Go for musketss. We didn't really Oh, what? The targeting was weird. Feel like they should have all gone for different targets there. But let's go for a miner with the one musketeer. And let's see how he defends all this. So he Ooh, rather go for a normal musketeer than then rely on my evo skeletons because then I cycle to the evo. All right that gets a hit if I don't go for skeletons. So let's go for skellies here as well. It looks where like we're against log bait. The question is does he have a big spell? Let's go for musketss. [ __ ] it. Go for musketss. We didn't really Oh, what? The targeting was weird. Feel like they should have all gone for different targets there. But let's go for a miner with the one musketeer. And let's see how he defends all this. So he Ooh,"
        },
        {
            "12:30": "that's that's nice cuz we're going to get log value on the right. And that one musketeer hitting the knight does so much damage. And then we can just mirror our log. Going against bait when we have the mirror is nasty. Oh, this is great. All right, this Okay, we're going to go for this for the ice spirit. Perfect. That's going to counter all all that, which is nice. I do want to beat this guy. This guy seems a little tryhardy, but we do get some damage to start on that lane. Now, it it's so good when you that's that's nice cuz we're going to get log value on the right. And that one musketeer hitting the knight does so much damage. And then we can just mirror our log. Going against bait when we have the mirror is nasty. Oh, this is great. All right, this Okay, we're going to go for this for the ice spirit. Perfect. That's going to counter all all that, which is nice. I do want to beat this guy. This guy seems a little tryhardy, but we do get some damage to start on that lane. Now, it it's so good when you"
        },
        {
            "13:00": "get the Evo Musk as well cuz then you can snipe Princess and [ __ ] dark goblins across the map. So, I might just go for a musk in the back in this lane. Wait and see what little bro is going to do. Will he go Princess of the Bridge? Okay, that's fine with me. I might even just let my musketeer go, not even play an ice golem. And I'm just going to go for three musketss in the back here. Now, let's see what he's going to do. He can't really pressure. I'll go for a log just to take out the uh dark goblin and let it hopefully take out most of that. get the Evo Musk as well cuz then you can snipe Princess and [ __ ] dark goblins across the map. So, I might just go for a musk in the back in this lane. Wait and see what little bro is going to do. Will he go Princess of the Bridge? Okay, that's fine with me. I might even just let my musketeer go, not even play an ice golem. And I'm just going to go for three musketss in the back here. Now, let's see what he's going to do. He can't really pressure. I'll go for a log just to take out the uh dark goblin and let it hopefully take out most of that."
        },
        {
            "13:30": "And then let's go for this. Let's go for a miner. And then in case he goes for a goblin gang on the left. Okay, so he's going to go with that. That's fine. That's fine by me. He might go for a golden barrel. So, I'm going to go for musketss here. So, let's go for 3M. Oh my god. Perfect timing for the Evo barrel as well. And that's going to shut down most of that. That's fine. Now, let's go for an ice golem. I hope he plays this dark goblin at some point cuz And then let's go for this. Let's go for a miner. And then in case he goes for a goblin gang on the left. Okay, so he's going to go with that. That's fine. That's fine by me. He might go for a golden barrel. So, I'm going to go for musketss here. So, let's go for 3M. Oh my god. Perfect timing for the Evo barrel as well. And that's going to shut down most of that. That's fine. Now, let's go for an ice golem. I hope he plays this dark goblin at some point cuz"
        },
        {
            "14:00": "I've got my Evo musketeer. Let's go for this. Let's snipe the Let's snipe the dark goblin right away. Just take it off the map. There's so many goofy interactions. This is so good. And then I'm going to go for an ice golem cuz the the musketeer still has its evo bullets, but he's not going to play anything in a position that's going to give it value, I don't think. So, oh my god, it did snipe something there. Let's go for musketss again. Every time he goes golden barrel, there's just like a thousand things that I've got my Evo musketeer. Let's go for this. Let's snipe the Let's snipe the dark goblin right away. Just take it off the map. There's so many goofy interactions. This is so good. And then I'm going to go for an ice golem cuz the the musketeer still has its evo bullets, but he's not going to play anything in a position that's going to give it value, I don't think. So, oh my god, it did snipe something there. Let's go for musketss again. Every time he goes golden barrel, there's just like a thousand things that"
        },
        {
            "14:30": "can kill it. He is getting chip damage cuz the 3M have the new 3M have weird targeting, I feel like. But I'm going to do what I did last game and I'm going to finish it off with a double miner and see what he does here. Oh, it does show the position. [ __ ] He caught them. Oh no, he didn't caught catch them both. And the level 16 miner [ __ ] one-shots goblins. And that's going to be GG. Oh my god. Holy smokes. You got mirror log. You got musketeer spam. This is so good. can kill it. He is getting chip damage cuz the 3M have the new 3M have weird targeting, I feel like. But I'm going to do what I did last game and I'm going to finish it off with a double miner and see what he does here. Oh, it does show the position. [ __ ] He caught them. Oh no, he didn't caught catch them both. And the level 16 miner [ __ ] one-shots goblins. And that's going to be GG. Oh my god. Holy smokes. You got mirror log. You got musketeer spam. This is so good."
        },
        {
            "15:00": "This is so good. Am I at 15? How many trophies am I at? So, right now I'm at 15 14200. Getting to 15,000 trophies in the ruin in the ruin in the ruin arena. All right, we've got Evo Ice Spirit to cycle. Now, I want to get to my musketeer. All right, [ __ ] it. You know what? If he's going to split a card in the back, I'm just going to split 3M. I feel like it's a way better player now that they're less vulnerable to spells cuz of the rework. And let's see what This is so good. Am I at 15? How many trophies am I at? So, right now I'm at 15 14200. Getting to 15,000 trophies in the ruin in the ruin in the ruin arena. All right, we've got Evo Ice Spirit to cycle. Now, I want to get to my musketeer. All right, [ __ ] it. You know what? If he's going to split a card in the back, I'm just going to split 3M. I feel like it's a way better player now that they're less vulnerable to spells cuz of the rework. And let's see what"
        },
        {
            "15:30": "little Squeak's got for me. He's playing, I think, Royal Recruits, Flying Machine, uh, Royal Hogs. So, this is going to be interesting because he's I think he might be playing fireball or he might be Oh my god, the new musketeer is going to hit that barrel down. Holy [ __ ] that is so much damage. So, he might go for royal hogs here. [ __ ] Okay, so he chose to take that damage to build up a massive flying machine royal hogs push. This is not going to be very epic. Let's go for a musk. I might even little Squeak's got for me. He's playing, I think, Royal Recruits, Flying Machine, uh, Royal Hogs. So, this is going to be interesting because he's I think he might be playing fireball or he might be Oh my god, the new musketeer is going to hit that barrel down. Holy [ __ ] that is so much damage. So, he might go for royal hogs here. [ __ ] Okay, so he chose to take that damage to build up a massive flying machine royal hogs push. This is not going to be very epic. Let's go for a musk. I might even"
        },
        {
            "16:00": "mirror my mask here. In fact, I will. And then I'll go for this for the flying machine. Let's see if he's going to play it. No. Okay. So, we're just going to try and rely on um our musketss to kill stuff. Was hoping to absorb the dash there, but it looks like he's just going to go for it a bit late. Let's go for a minor. And we're still winning. So, it's not the end of the world. That could have definitely gone better, but that's fine. It was a goofy defense. And he's mirror my mask here. In fact, I will. And then I'll go for this for the flying machine. Let's see if he's going to play it. No. Okay. So, we're just going to try and rely on um our musketss to kill stuff. Was hoping to absorb the dash there, but it looks like he's just going to go for it a bit late. Let's go for a minor. And we're still winning. So, it's not the end of the world. That could have definitely gone better, but that's fine. It was a goofy defense. And he's"
        },
        {
            "16:30": "going to waste his zappies there, which is good. Musky's going to get a couple hits. I don't have to deal with that. And I reckon we just 3M the back. I think he's playing arrows and barb barrel as his spells, which is kind of annoying because the barb barrel is just kind of a good copout answer against the two the two musketeers. Not as much as it used to be, though, because they'll hit it with the with the musk gun. The bayonet. That's the one. Anyway, I've got a weird cycle, so I'm going to go with this and this and hopefully we can going to waste his zappies there, which is good. Musky's going to get a couple hits. I don't have to deal with that. And I reckon we just 3M the back. I think he's playing arrows and barb barrel as his spells, which is kind of annoying because the barb barrel is just kind of a good copout answer against the two the two musketeers. Not as much as it used to be, though, because they'll hit it with the with the musk gun. The bayonet. That's the one. Anyway, I've got a weird cycle, so I'm going to go with this and this and hopefully we can"
        },
        {
            "17:00": "squeeze that in front of the one musket. Okay, let's go for a musketeer and try and snipe that. Um, taking out the There's the flying machine. Okay, if we can take out the flying machine, I'm happy. Yeah, that musketeer value is insane. And it pulls that. That was a clutch mask. And now he has to deal with that. And we just go for this in the back. Okay, we're going to have to take a lot of damage here. I'm not going to lie. But luckily, we have one musketeer helping. So, that's not going to be squeeze that in front of the one musket. Okay, let's go for a musketeer and try and snipe that. Um, taking out the There's the flying machine. Okay, if we can take out the flying machine, I'm happy. Yeah, that musketeer value is insane. And it pulls that. That was a clutch mask. And now he has to deal with that. And we just go for this in the back. Okay, we're going to have to take a lot of damage here. I'm not going to lie. But luckily, we have one musketeer helping. So, that's not going to be"
        },
        {
            "17:30": "terrible. Let's go for this. I'm going to choose to go for my evolve musket here. And then let's go for a miner right here. And he's going to go for royal. Yep. Okay. Let's go like this and this. And it's really hard to get through the royal recruits with the three musketeers. I'm not going to lie. Especially with the pigs. Okay. Let's go with musketss. He's probably going to go royal hogs. I wish I had Oh god. Okay. Okay. We have to go with a terrible. Let's go for this. I'm going to choose to go for my evolve musket here. And then let's go for a miner right here. And he's going to go for royal. Yep. Okay. Let's go like this and this. And it's really hard to get through the royal recruits with the three musketeers. I'm not going to lie. Especially with the pigs. Okay. Let's go with musketss. He's probably going to go royal hogs. I wish I had Oh god. Okay. Okay. We have to go with a"
        },
        {
            "18:00": "log here as soon as we can. And we got to hope that we don't die. Come on. Okay. We're still alive. We're still alive. I think we're still alive. Was a dream. He just has to cycle back though. If we win this, it'll be insane. [ __ ] I don't think it's going to happen. This was a uh a horrible matchup to get. [ __ ] man. the dream. No. Okay, at least musketeers going to help out there, but it's over. Nah, it's going to be GG's. log here as soon as we can. And we got to hope that we don't die. Come on. Okay. We're still alive. We're still alive. I think we're still alive. Was a dream. He just has to cycle back though. If we win this, it'll be insane. [ __ ] I don't think it's going to happen. This was a uh a horrible matchup to get. [ __ ] man. the dream. No. Okay, at least musketeers going to help out there, but it's over. Nah, it's going to be GG's."
        },
        {
            "18:30": "All right. Well, I still had a lot of fun playing with five musketeers. Not even five. 500 musketeers, but of course, Royal Recruits is the downfall of all fun and games, and it is bad. [Music] All right. Well, I still had a lot of fun playing with five musketeers. Not even five. 500 musketeers, but of course, Royal Recruits is the downfall of all fun and games, and it is bad. [Music]"
        }
    ],
    "extraction_timestamp": "2025-11-06T15:31:17.317Z"
}